
import numpy as np
from scipy.stats import skew, kurtosis
from scipy import stats
import matplotlib.pyplot as plt

# Данная выборка
x = [3.150857199, 2.92789912, -1.827016488, 5.980724952, -0.2540931493, 2.322298431,
    -0.6653507373, 2.057072723, 4.684149306, -1.935112207, -0.8603896024, 3.246626991,
     2.992673333, 2.086427801, 2.133610112, 0.6560370619, -0.9576157229, -1.294914339,
     2.641046765, 0.2627363099, 0.7167287802, -7.062015695, 3.673982635, 3.429148935,
    -0.4696092876, 6.864576451, 1.078382527, -0.2069142485, 6.283886821, 0.7773011273,
    -2.039094736, 4.43370175, -1.781198418, 1.561044544, -0.05731487565, 4.882360033,
     0.1860863702, 0.02798094809, -4.250653885, 1.18520609, 0.4802442416, 0.7950158104,
    -0.4740123788, -1.773797405, 0.489326683, 2.401161853, -3.055223144, 0.7081954461,
    -4.995680112, -0.9860976863]


# Количество элементов в выборке
n = 50

# Построение вариационного ряда
x = sorted(x)

# Поиск минимального и максимального
# элементов выборки
xmax = max(x)
xmin = min(x)

# Определим количество интервалов по формуле Стерджесса
b = 3.332
r = round(1 + b * np.log10(n))

# Длина интервала
stp = (xmax - xmin) / r

# Определяем середины интервалов
centr = []
centr.append(xmin + (stp / 2))
for i in range(1, r):
    centr.append(centr[i - 1] + stp)

# Определяем абсолютную частоту
k1 = xmin
freqn = []
i = 1
while i <= r:
    k2 = 0
    for j in range(n):
        if (x[j] >= k1) and (x[j] <= k1 + stp):
            k2 += 1
    freqn.append(k2)
    k1 = xmin + (stp*i)
    i += 1

# Числовые характеристики выборки

# Выборочное среднее
m = np.mean(x)

# Дисперсия
D = np.var(x)

# Ср. кв. отклонение
SKO = np.std(x)

# Мода
moda = float(stats.mode(x, keepdims=True)[0])

# Медиана
med = np.median(x)

# Коэффициент эксцесса
kurt = kurtosis(x)

# Коэффициент асимметрии
skew = skew(x)

# Вывод значений
print('Максимальное значение = ',xmax)
print('Минимальное значение = ',xmin)
print('Количество интервалов = ',r)
print('Длина одного интервала = ',stp)
print('Выборочное среднее = ', m)
print('Выборочная дисперсия = ',D)
print('Ср. кв. отклонение = ',SKO)
print('Мода = ',moda)
print('Медиана = ',med)
print('Коэффициент эксцесса = ',kurt)
print('Коэффициент асимметрии = ',skew)


# Построение полигона частот
plt.figure()
plt.plot(centr, freqn, 'r-o')
plt.xlabel('Интервалы')
plt.ylabel('Относительная частота')
plt.title("Полигон частот")
plt.grid(True)

# Построение гистограммы
plt.figure()
plt.hist(x, r)
plt.xlabel('Интервалы')
plt.ylabel('Частота')
plt.title("Гистограмма")
plt.grid(True)

# Построение эмпирической функции распределения
fig = plt.figure()
plt.plot(np.sort(x), np.arange(1, len(x)+1) / len(x))
plt.xlabel('x')
plt.ylabel('F(x)')
plt.grid(True)
plt.title("График эмпирической функции распределения")
plt.show()
